In [1]:
import psycopg2 
import pandas as pd

In [2]:
PGHOST='localhost'
PGDATABASE='postgres'
PGUSER='postgres'
PGPASSWORD='postgres'

In [5]:
# Set up a connection to the postgres server.
conn_string = "host="+ PGHOST +" port="+ "5432" +" dbname="+ PGDATABASE +" user=" + PGUSER \
+" password="+ PGPASSWORD
connection=pg.connect(conn_string)

print("Connected!")

Connected!

In [7]:
dataframe = pd.read_sql("SELECT * FROM h1b_yearly_performance_model ", connection)

In [9]:
dataframe.head()

,employment_duration_years,us_region,annual_salary_band,naics_code_2,yyyy,case_status
0,2,Northeast,b1,52,2012,0
1,2,Northeast,b2,54,2012,1
2,2,South,b1,71,2012,1
3,2,West,b2,45,2012,1
4,2,South,b2,54,2012,1

In [10]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(dataframe, test_size=0.2)

In [11]:
train.head()

,employment_duration_years,us_region,annual_salary_band,naics_code_2,yyyy,case_status
2460294,3,Midwest,b2,54,2015,1
2877852,3,Northeast,b1,52,2016,1
3044914,3,Northeast,b1,54,2016,1
4290492,3,South,b2,54,2018,1
437921,3,Northeast,b2,54,2010,0

In [12]:
train.count()

employment_duration_years    3826224
us_region                    3826224
annual_salary_band           3826126
naics_code_2                 3826224
yyyy                         3826224
case_status                  3826224
dtype: int64

In [13]:
test.count()

employment_duration_years    956557
us_region                    956557
annual_salary_band           956527
naics_code_2                 956557
yyyy                         956557
case_status                  956557
dtype: int64

In [14]:
train_set_labels = train.pop('case_status')
test_set_labels = test.pop('case_status')

In [15]:
train.head()

,employment_duration_years,us_region,annual_salary_band,naics_code_2,yyyy
2460294,3,Midwest,b2,54,2015
2877852,3,Northeast,b1,52,2016
3044914,3,Northeast,b1,54,2016
4290492,3,South,b2,54,2018
437921,3,Northeast,b2,54,2010

In [19]:
emp_dur_dummies = pd.get_dummies(dataframe['employment_duration_years'])

In [20]:
emp_dur_dummies.head()

   0  1  2  3  4
0  0  0  1  0  0
1  0  0  1  0  0
2  0  0  1  0  0
3  0  0  1  0  0
4  0  0  1  0  0